//
// Created by fakys on 10.08.2026.
//


#ifndef AVR_PROTO_UART_H
#define AVR_PROTO_UART_H

#include <avr/io.h>
/*
 *
 * UBRR0H и UBRR0L - частота разбитака на 2 байта
 * UCSR0B - включение передатчика и приемника где 4 байт - приемнику а 5 - передатчику
 * UCSR0C - настройка передачи
 *
 * UDR0 - регистер в котором хранятся данные
 * UCSR0A - отвечает за состояние буфера
 * Биты:
 *      MPCM0 - Режим мультипроцессора. Редко используется. Позволяет фильтровать адреса в сетях с несколькими мастерами/слейвами.
 *      U2X0 - Удвоение скорости. Используется только при инициализации. Если установлен, делитель частоты уменьшается вдвое, что позволяет достичь более высоких скоростей или точнее попасть в нестандартный baud rate.
 *      UPE0 - Ошибка чётности. Если включена проверка чётности, этот бит сигнализирует о несовпадении.
 *      DOR0 - Переполнение данных. Устанавливается, если новый байт пришёл, а предыдущий ещё не был прочитан из UDR0. Предыдущий байт теряется безвозвратно.
 *      FE0 - Ошибка кадра. Устанавливается, если вместо ожидаемого стоп-бита пришёл логический 0. Обычно означает рассинхронизацию скоростей (baud rate mismatch).
 *      UDRE0 - (TX) Буфер на отправку данных пуст. Устанавливается в 1, когда регистр UDR0 свободен и готов принять новый байт для отправки. Это ключевой бит для неблокирующей записи!
 *      TXC0 - Флаг завершения передачи. Устанавливается в 1, когда весь кадр (старт+данные+стоп) полностью ушёл с пина TX. Сбрасывается аппаратно при запуске нового прерывания TX или программно записью 1 в этот бит.
 *      RXC0 - (RX) Флаг завершения приёма. Устанавливается в 1, когда в буфер принял новый байт и его можно читать из UDR0. Сбрасывается автоматически при чтении UDR0 или при выполнении ISR прерывания приёма.
 */

//Проверяет что данные были успешно переданны
bool dataSuccessSend();

//Проверяем пуст ли буфер и можем ли мы отправлять новый кадр
bool checkTransferBuffer();

bool sendMessage(uint8_t byte);

//Вернет true когда буфер будет готов к чтению
bool bufferReadyReadData();

void initUart(int baud_rate);

uint8_t receiveMessage();

#endif //AVR_PROTO_UART_H
